perf/alternate.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"

  pool: 50
  phases:
    - duration: 30
      arrivalRate: 1
    - duration: 30
      arrivalRate: 2
    - duration: 30
      arrivalRate: 3

  plugins:
    publish-metrics:
      - type: datadog
        apiKey: "{{ $processEnvironment.DATADOG_API_KEY }}"
        prefix: "artillery."
        tags:
          - "test:alternate"

scenarios:
  - flow:
    - get:
        url: '/alternate'