perf/remote_cached_scaling_break.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 30
      arrivalRate: 1000
    - duration: 30
      arrivalRate: 3000
  plugins:
    publish-metrics:
      - type: datadog
        apiKey: "{{ $processEnvironment.DATADOG_API_KEY }}"
        prefix: "artillery."
        tags:
          - "test:remote:cached:scaling:break"

scenarios:
  - flow:
    - get:
        url: '/remote/cached'