perf/remote_cached_stress.yaml
config:
  target: "{{ $processEnvironment.TARGET }}"
  phases:
    - duration: 30
      arrivalRate: 10
    - duration: 30
      arrivalRate: 20
    - duration: 30
      arrivalRate: 40
    - duration: 30
      arrivalRate: 80 
    - duration: 30
      arrivalRate: 100
  plugins:
    publish-metrics:
      - type: datadog
        apiKey: "{{ $processEnvironment.DATADOG_API_KEY }}"
        prefix: "artillery."
        tags:
          - "test:remote:cached:stress"

scenarios:
  - flow:
    - get:
        url: '/remote/cached'